
&НаКлиенте
Процедура Расш66_РазрешитьРедактированиеПосле(Команда)
	ЭтотОбъект.ОбщаяСуммаОплатыПлатежнымиКартами = 0;
	ЭтотОбъект.ИспользоватьОплатуПлатежнымиКартами = Ложь;
	
	ДоступныеВидыОплаты = ДоступныеВидыОплаты(ЭтотОбъект);
	Для Каждого Элемент Из ДоступныеВидыОплаты Цикл
		Если Элемент.Ключ <> "Наличные" Тогда
			ДоступныеВидыОплаты[Элемент.Ключ] = Ложь;	
		КонецЕсли;
	КонецЦикла; 
	
	Элементы.Товары.ТолькоПросмотр = Ложь;
	Элементы.ОплатитьКартой.Видимость = Ложь;
	Элементы.СмешаннаяОплата.Видимость = Ложь;
КонецПроцедуры
